app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    　post = Post.create(content: params[:content], checked: false)
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('こんにちは、', '2021-02-17 02:50:56.232311', '2021-02-17 02:50:56.232311')

  def checked
    post = Post.find(params[:id])
    if post.checked
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2021-02-17 03:24:01.917091' WHERE `posts`.`id` = 1
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2021-02-17 03:24:23.982663' WHERE `posts`.`id` = 1